//1. Напишите программу, в которой используются как «короткие», так и «длинные»
//   команды печати

import static chapter2.Print.*;

public class Ex1 {
  public static void main(String[] args) {
    System.out.println("длинная команда печати");
    print("короткая команда печати");
  }
}