//3.  Найдите фрагмент кода с классом ATypeName и сделайте из него программу, пригодную для компиляции и запуска.
import chapter1.ATypeName;

public class Exercise3 {
  public static void main(String[] args) {
    ATypeName name = new ATypeName();
    System.out.println(name);
  }
}