//1. Создайте класс с полями int и char, которые не инициализируются в программе.
//   Выведите их значения, чтобы убедиться в том, что Java выполняет инициализацию
//   по умолчанию.

public class Exercise1 {
  static int Int;
  static char Char;

  public static void main(String[] args) {
    System.out.println(Int);
    System.out.println(Char);
  }
}